# language: zh-CN

功能:人工设置预期彩期状态

  背景:
    假设系统里有下面的彩种:
    |        name       | lotno  | money | moneymulti | betmore |
    |    重庆时时彩       | T01007 | 2     | 1          | 0       | 
    |    重庆时时彩[五星] | T01007 | 2     | 1          | 0       | 
    |    重庆时时彩[三星] | T01007 | 2     | 1          | 0       |
    |    重庆时时彩[二星] | T01007 | 2     | 1          | 0       |
    |    重庆时时彩[一星] | T01007 | 2     | 1          | 0       |
    | 重庆时时彩[大小单双] | T01007 | 2     | 1          | 0       |
    |    福彩3D[直选]    | F47103  | 2    |  1         |  0      |
    |    福彩3D[组六]    | F47103  | 2    |  1         |  0      |
    |    福彩3D[组三]    | F47103  | 2    |  1         |  0      |
    |    双色球          | F47104 | 2     | 1          | 0       |
    | 排列三[组六]       | T01002 | 2     | 1          | 0       |
    | 排列三[组三]       | T01002 | 2     | 1          | 0       |
    | 排列三[直选]       | T01002 | 2     | 1          | 0       |
    |    大乐透         | T01001 | 2     | 1          | 0       |

    并且我购买了下面的追号:
    | 彩种            | 追号期数 | 追号倍数 | 注码            | 已追期数  |   最近已追期号    |
    | 重庆时时彩[五星] | 5       |   2     | 02~09~05~00~03 |   1      |    20121122025   |
    | 重庆时时彩[三星] | 8       |   1     | 06~00~03       |   1      |    20121122025   |


   场景大纲:
     假设设置"<彩种>"的"<预彩期>"的状态为"<状态>"
     当收到"<彩种>"的"<新期>"
     那么我漏追的彩期是"<漏追彩期>"

   例子: 撤销
     | 彩种      | 预彩期        | 状态 | 新期         | 漏追彩期     |
     | 重庆时时彩 | 20121122026  | 撤销 | 20121122028 | 20121122027 |

   例子: 跳期
     | 彩种      | 预彩期        | 状态 | 新期         | 漏追彩期     |
     | 重庆时时彩 | 20121122026  | 跳期 | 20121122028 | 20121122027 |

   例子: 默认
     | 彩种      | 预彩期        | 状态 | 新期         | 漏追彩期                  |
     | 重庆时时彩 | 20121122026  | 默认 | 20121122028 | 20121122026,20121122027  |
     


