# language: zh-CN

功能:追排列三
  为了方便客户使用相同的号码连续投注3D彩票

  背景:
    假设系统里有下面的彩种:
    |    name         | lotno  | money |moneymulti  | betmore |
    | 排列三           | T01002 | 2     | 1          | 0       |
    | 排列三[组六]      | T01002 | 2     | 1          | 0       |
    | 排列三[组三]      | T01002 | 2     | 1          | 0       |
    | 排列三[直选]      | T01002 | 2     | 1          | 0       | 

  场景大纲: 追排列三
    当客户投注"<彩种>"
    并且客户选择号码"<注码>"进行投注
    并且客户选择"<倍数>"倍
    同时客户追"<期数>"期
    当第"1"次新期入库后
    同时系统检测到新期
    并且投注"成功"
    那么客户应该增加"1"条新的投注记录
    并且投注号码是"<注码>"
    同时客户的投注结果应该成功
    同时客户投注结果应该入库成功
    当第"2"次新期入库后
    同时系统检测到新期
    并且投注"成功"
    那么客户应该增加"1"条新的投注记录
    并且投注号码是"<注码>"
    同时客户的投注结果应该成功
    同时客户投注结果应该入库成功
    当第"3"次新期入库后
    同时系统检测到新期
    并且投注"成功"
    那么客户应该增加"1"条新的投注记录
    并且投注号码是"<注码>"
    并且客户的投注结果应该成功
    同时客户投注结果应该入库成功
    同时客户的追号应该结束
    当第"4"次新期入库后
    那么客户不会产生新的投注记录

  @pl36
  例子: 排列三[组六]
    | 彩种             |   注码                  | 倍数 | 期数 |
    | 排列三[组六]     | 00020304                | 1   | 3    |
    | 排列三[组六]     | 0001020304              | 4   | 3    |
    | 排列三[组六]     | 00010203040506          | 7   | 3    |
    | 排列三[组六]     | 00020608                | 8   | 3    |
    | 排列三[组六]     | 0102030405060708        | 10  | 3    |
    | 排列三[组六]     | 000102030405060709      | 11  | 3    |
    | 排列三[组六]     | 010307                  | 1   | 3    |
    | 排列三[组六]     | 000406                  | 98  | 3    |
    | 排列三[组六]     | 000406                  | 99  | 3    |
    | 排列三[组六]     | 000406                  | 2   | 3    |
    | 排列三[组六]     | 000102                  | 1   | 3    |
    | 排列三[组六]     | 050607                  | 1   | 3    |
    | 排列三[组六]     | 02030506                | 1   | 3    |
    | 排列三[组六]     | 010508                  | 1   | 3    |
    # 组六不能选全号
    # | 排列三[组六]     | 00010203040506070809    | 1   | 3    |

  例子: 排列三[组三]
    | 彩种             |   注码                  | 倍数 | 期数 |
    | 排列三[组三]     | 0002                    | 1   | 3    |
    | 排列三[组三]     | 0001020304              | 4   | 3    |
    | 排列三[组三]     | 00010203040506          | 7   | 3    |
    | 排列三[组三]     | 00020608                | 8   | 3    |
    | 排列三[组三]     | 0102030405060708        | 10  | 3    |
    | 排列三[组三]     | 00010203040506070809    | 11  | 3    |
    | 排列三[组三]     | 0507                    | 1   | 3    |
    | 排列三[组三]     | 000102                  | 1   | 3    |
    | 排列三[组三]     | 0305                    | 1   | 3    |
    | 排列三[组三]     | 0308                    | 1   | 3    |
    | 排列三[组三]     | 0309                    | 1   | 3    |
    | 排列三[组三]     | 020708                  | 1   | 3    |

  例子: 排列三[直选]
    | 彩种             |   注码                  | 倍数 | 期数 |
    | 排列三[直选]     | 00~02~06                | 1   | 3    |
    | 排列三[直选]     | 00~010203~04            | 4   | 3    |
    | 排列三[直选]     | 0001~0203~040506        | 7   | 3    |
    | 排列三[直选]     | 0002~06~08              | 8   | 3    |
    | 排列三[直选]     | 010203~040506~0708      | 10  | 3    |
    | 排列三[直选]     | 000102~0304~0506070809  | 11  | 3    |
    | 排列三[直选]     | 08~06~04                | 50  | 3    |
    | 排列三[直选]     | 08~06~04                | 49  | 3    |
    | 排列三[直选]     | 08~06~04                | 99  | 3    |
    | 排列三[直选]     | 00~00~00                | 51  | 3    |

  @hunhe
  例子: 混合
    | 彩种             |   注码                  | 倍数 | 期数 |
    | 排列三[组六]     | 01030708                | 1   | 3    |
    | 排列三[组六]     | 050607                  | 4   | 3    |
    | 排列三[组六]     | 010203                  | 99  | 3    |
    | 排列三[组三]     | 0507                    | 1   | 3    |
    | 排列三[组三]     | 0206                    | 4   | 3    |
    | 排列三[组三]     | 020708                  | 7   | 3    |
    | 排列三[直选]     | 03~03~03                | 1   | 3    |
    | 排列三[直选]     | 06~01~00                | 4   | 3    |
    | 排列三[直选]     | 00~00~00                | 99  | 3    |



