# language: zh-CN

功能:发生漏追时需要生成下注记录

  背景:
    假设系统里有下面的彩种:
    |        name       | lotno  | money | moneymulti | betmore |
    |    重庆时时彩       | T01007 | 2     | 1          | 0       | 
    |    重庆时时彩[五星] | T01007 | 2     | 1          | 0       | 
    |    重庆时时彩[三星] | T01007 | 2     | 1          | 0       |
    |    重庆时时彩[二星] | T01007 | 2     | 1          | 0       |
    |    重庆时时彩[一星] | T01007 | 2     | 1          | 0       |
    | 重庆时时彩[大小单双] | T01007 | 2     | 1          | 0       |
    |    福彩3D[直选]    | F47103  | 2    |  1         |  0      |
    |    福彩3D[组六]    | F47103  | 2    |  1         |  0      |
    |    福彩3D[组三]    | F47103  | 2    |  1         |  0      |
    |    双色球          | F47104 | 2     | 1          | 0       |
    | 排列三[组六]       | T01002 | 2     | 1          | 0       |
    | 排列三[组三]       | T01002 | 2     | 1          | 0       |
    | 排列三[直选]       | T01002 | 2     | 1          | 0       |
    |    大乐透         | T01001 | 2     | 1          | 0       |

    并且我购买了下面的追号:
    | 彩种            | 追号期数 | 追号倍数 | 注码            | 已追期数  |   最近已追期号    |
    | 重庆时时彩[五星] | 5       |   2     | 02~09~05~00~03 |   1      |    20121122025   |
    | 重庆时时彩[三星] | 8       |   1     | 06~00~03       |   1      |    20121122025   |


  场景:追号系统宕机
    假设追号系统宕机
    当系统恢复后取到的"重庆时时彩"的新彩期号是"20121122027"
    那么我漏掉"重庆时时彩[五星]"的追号"1"期
    同时我漏掉"重庆时时彩[三星]"的追号"1"期
    并且我漏掉的"重庆时时彩[五星]"的彩期号是"20121122026"
    同时我漏掉的"重庆时时彩[三星]"的彩期号是"20121122026"
    并且我有下面漏追的下注记录:
    | 彩种               | 彩期号           |
    | 重庆时时彩[五星]    | 20121122026      |
    | 重庆时时彩[三星]    | 20121122026      |
