# language: zh-CN

功能:系统运行时,不允许追旧的彩期

  背景:
    假设系统里有下面的彩种:
    |        name       | lotno  | money | moneymulti | betmore |
    |    重庆时时彩       | T01007 | 2     | 1          | 0       | 
    |    重庆时时彩[五星] | T01007 | 2     | 1          | 0       | 
    |    重庆时时彩[三星] | T01007 | 2     | 1          | 0       |
    |    重庆时时彩[二星] | T01007 | 2     | 1          | 0       |
    |    重庆时时彩[一星] | T01007 | 2     | 1          | 0       |
    | 重庆时时彩[大小单双] | T01007 | 2     | 1          | 0       |
    |    福彩3D          | F47103  | 2    |  1         |  0      |
    |    福彩3D[直选]    | F47103  | 2    |  1         |  0      |
    |    福彩3D[组六]    | F47103  | 2    |  1         |  0      |
    |    福彩3D[组三]    | F47103  | 2    |  1         |  0      |
    |    双色球          | F47104 | 2     | 1          | 0       |
    | 排列三             | T01002 | 2     | 1          | 0       |
    | 排列三[组六]       | T01002 | 2     | 1          | 0       |
    | 排列三[组三]       | T01002 | 2     | 1          | 0       |
    | 排列三[直选]       | T01002 | 2     | 1          | 0       |
    |    大乐透         | T01001 | 2     | 1          | 0       |
    并且系统已经存在下面的渠道彩期:
    | 彩种             | 彩期          | 开始时间               | 结束时间               |
    | 重庆时时彩        |  20121203027 | 2012-12-03 10:19:00   | 2012-12-03 10:29:00   |
    | 重庆时时彩[五星]  | 20121203027  | 2012-12-03 10:19:00   | 2012-12-03 10:29:00   |
    | 重庆时时彩[五星]  | 20121203026  | 2012-12-03 10:09:00   | 2012-12-03 10:19:00   |
    | 重庆时时彩[五星]  | 20121203025  | 2012-12-03 09:59:00   | 2012-12-03 10:09:00   |
    | 重庆时时彩[三星]  | 20121203027  | 2012-12-03 10:19:00   | 2012-12-03 10:29:00   |
    | 重庆时时彩[三星]  | 20121121026  | 2012-12-03 10:09:00   | 2012-12-03 10:19:00   |
    同时我购买了下面的追号:
    | 彩种            | 追号期数 | 追号倍数 | 注码            | 已追期数  | 
    | 重庆时时彩[五星] | 3       |   2     | 02~09~05~00~03 |   0      | 
    | 重庆时时彩[三星] | 8       |   1     | 06~00~03       |   0      | 

  场景:系统启动
     当追号系统启动时
     那么不应该对这些追号记录进行追号:
     | prebetid |
     | 1        |
     | 2        |
     并且这些彩期应该变为"已追", "已入库":
     | 彩种      | 彩期        |
     | 重庆时时彩 |20121203027 |


