# language: zh-CN

功能:多用户多彩种条件下的追号
  在生产环境下须保证多用户多彩种的追号不出错

  背景:
    假设系统里有下面的彩种:
    |        name       | lotno  | money | moneymulti | betmore |
    |    重庆时时彩     | T01007 | 2     | 1          | 0       | 
    |    重庆时时彩[五星] | T01007 | 2     | 1          | 0       | 
    |    重庆时时彩[三星] | T01007 | 2     | 1          | 0       |
    |    重庆时时彩[二星] | T01007 | 2     | 1          | 0       |
    |    重庆时时彩[一星] | T01007 | 2     | 1          | 0       |
    | 重庆时时彩[大小单双] | T01007 | 2     | 1          | 0       |
    |    福彩3D        | F47103  | 2    |  1         |  0      |
    |    福彩3D[直选]    | F47103  | 2    |  1         |  0      |
    |    福彩3D[组六]    | F47103  | 2    |  1         |  0      |
    |    福彩3D[组三]    | F47103  | 2    |  1         |  0      |
    |    双色球          | F47104 | 2     | 1          | 0       |
    | 排列三             | T01002 | 2     | 1          | 0       |
    | 排列三[组六]       | T01002 | 2     | 1          | 0       |
    | 排列三[组三]       | T01002 | 2     | 1          | 0       |
    | 排列三[直选]       | T01002 | 2     | 1          | 0       |
    |    大乐透         | T01001 | 2     | 1          | 0       | 


    
    并且有下面的追号数据:
    # 彩种名                 用户数     追几期
    | lot_name            | users_num | terms_num |
    | 福彩3D               |  0        |    0      |
    | 福彩3D[直选]         |  10       |    3      |
    | 福彩3D[组六]         |  10       |    3      |
    | 福彩3D[组三]         |  10       |    3      |
    | 排列三              |  0         |    0      |
    | 排列三[直选]         |  10       |    3      |
    | 排列三[组六]         |  10       |    3      |
    | 排列三[组三]         |  10       |    3      |
    | 双色球              |  10       |    3      |
    | 大乐透              |  10       |    3      |
    | 重庆时时彩          |  0        |    0      | 
    | 重庆时时彩[五星]      |  10       |   5       | 
    | 重庆时时彩[三星]      |  10       |   3       |
    | 重庆时时彩[二星]      |  10       |   8       |
    | 重庆时时彩[一星]      |  10       |   2       |
    | 重庆时时彩[大小单双]  |   10       |   2       |

   
   场景大纲: 收到新期通知
     当系统收到"<新期通知>"
     那么系统应该批量投注"<投注数目>"条追号记录
     并且每个客户的已追期数应该增加"1"

   例子: 重庆时时彩新期通知
      | 新期通知    | 投注数目 |
      | 重庆时时彩  |  50     |
      | 全部彩种    |  130    |


